//=============================================================================
//
// ボム数のUI [bomb_ui.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "bomb_ui.h"
#include "renderer.h"
#include "manager.h"

//=============================================================================
// static初期化
//=============================================================================
LPDIRECT3DTEXTURE9 CBombUi::m_apTexture[MAX_BOMB_UI_TEXTURE] = {};

//====================================================================
// ポリゴン生成
//====================================================================
CBombUi * CBombUi::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type)
{
	// インスタンス生成
	CBombUi *pBombUi = new CBombUi;

	if (pBombUi != NULL)
	{
		// 初期化処理
		pBombUi->Init(pos, size, type);

		// テクスチャの設定
		pBombUi->BindTexture(m_apTexture[0]);
	}

	return pBombUi;
}

//====================================================================
// コンストラクタ
//====================================================================
CBombUi::CBombUi()
{

}

//====================================================================
// デストラクタ
//====================================================================
CBombUi::~CBombUi()
{
}

//====================================================================
// 初期化処理
//====================================================================
HRESULT CBombUi::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type)
{
	// 初期化処理
	CScene2D::Init(pos, size, type);

	return S_OK;
}

//====================================================================
// 終了処理
//====================================================================
void CBombUi::Uninit(void)
{
	// 終了処理
	CScene2D::Uninit();
}

//====================================================================
// 更新処理
//====================================================================
void CBombUi::Update(void)
{
	// 更新処理
	CScene2D::Update();
}

//====================================================================
// 描画処理
//====================================================================
void CBombUi::Draw(void)
{
	// 描画処理
	CScene2D::Draw();
}

//====================================================================
// テクスチャロード
//====================================================================
HRESULT CBombUi::Load(void)
{
	// レンダラーの情報を受け取る
	CRenderer *pRenderer = NULL;
	pRenderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	// テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice, "date/TEXTURE/bomb000.png",
		&m_apTexture[0]);

	return S_OK;
}

//====================================================================
// テクスチャアンロード
//====================================================================
void CBombUi::UnLoad(void)
{
	for (int nCount = 0; nCount < MAX_BOMB_UI_TEXTURE; nCount++)
	{
		// テクスチャの開放
		if (m_apTexture[nCount] != NULL)
		{
			m_apTexture[nCount]->Release();
			m_apTexture[nCount] = NULL;
		}
	}
}