#ifndef _RESULT_H_
#define _RESULT_H_
//=============================================================================
//
// リザルトクラスヘッダー [result.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CResultBg;

//=============================================================================
// タイトルクラス
//=============================================================================
class CResult
{
public:

	CResult();				// コンストラクタ
	~CResult();				// デストラクタ

	HRESULT Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(void);						// 更新処理
	void Draw(void);						// 描画処理

	static CResultBg *GetResultBg(void);	// リザルト背景の情報
private:
	static CResultBg *m_pResultBg;			// タイトル背景のポインタ
};
#endif