//=============================================================================
//
// タイトル背景の処理 [titlebg.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//====================================================================
// インクルード
//====================================================================
#include "titlebg.h"
#include "renderer.h"
#include "manager.h"

//=============================================================================
// static初期化
//=============================================================================
LPDIRECT3DTEXTURE9 CTitleBg::m_apTexture[MAX_TITLEBG_TEXTURE] = {};

//====================================================================
// ポリゴン生成
//====================================================================
CTitleBg * CTitleBg::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type)
{
	// インスタンス生成
	CTitleBg *pTitleBg = new CTitleBg;

	if (pTitleBg != NULL)
	{
		// 初期化処理
		pTitleBg->Init(pos, size, type);

		// テクスチャの設定
		pTitleBg->BindTexture(m_apTexture[0]);
	}
	return pTitleBg;
}

//====================================================================
// コンストラクタ
//====================================================================
CTitleBg::CTitleBg()
{

}

//====================================================================
// デストラクタ
//====================================================================
CTitleBg::~CTitleBg()
{
}

//====================================================================
// 初期化処理
//====================================================================
HRESULT CTitleBg::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type)
{
	// 初期化処理
	CScene2D::Init(pos, size, type);

	return S_OK;
}

//====================================================================
// 終了処理
//====================================================================
void CTitleBg::Uninit(void)
{
	// 終了処理
	CScene2D::Uninit();
}

//====================================================================
// 更新処理
//====================================================================
void CTitleBg::Update(void)
{
	// 更新処理
	CScene2D::Update();
}

//====================================================================
// 描画処理
//====================================================================
void CTitleBg::Draw(void)
{
	// 描画処理
	CScene2D::Draw();

}

//====================================================================
// テクスチャロード
//====================================================================
HRESULT CTitleBg::Load(void)
{
	// レンダラーの情報を受け取る
	CRenderer *pRenderer = NULL;
	pRenderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	// テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice, "date/TEXTURE/title.png",
		&m_apTexture[0]);

	return S_OK;
}

//====================================================================
// テクスチャアンロード
//====================================================================
void CTitleBg::UnLoad(void)
{
	for (int nCount = 0; nCount < MAX_TITLEBG_TEXTURE; nCount++)
	{
		// テクスチャの開放
		if (m_apTexture[nCount] != NULL)
		{
			m_apTexture[nCount]->Release();
			m_apTexture[nCount] = NULL;
		}
	}
}