#ifndef _TITLEBG_H_
#define _TITLEBG_H_

//=============================================================================
//
// タイトル背景クラスヘッダー	[titlebg.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene2d.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_TITLEBG_TEXTURE		(1)			// テクスチャの数

//=============================================================================
// 前方宣言
//=============================================================================
class CScene2D;

//=============================================================================
// タイトルBgクラス
//=============================================================================
class CTitleBg : public CScene2D
{
public:
	CTitleBg();			// コンストラクタ
	~CTitleBg();			// デストラクタ

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type);	// 初期化処理
	void Uninit(void);											// 終了処理
	void Update(void);											// 更新処理
	void Draw(void);											// 描画処理

	static CTitleBg * Create(									// ポリゴン設定
		D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type);
	static HRESULT Load(void);									// テクスチャロード
	static void UnLoad(void);									// テクスチャアンロード

private:
	D3DXVECTOR3 m_Pos;											// 座標
	D3DXVECTOR3 m_move;											// 移動量
	static LPDIRECT3DTEXTURE9 m_apTexture[MAX_TITLEBG_TEXTURE];	// テクスチャ情報のポインタ
};

#endif