#ifndef _TITLE_H_
#define _TITLE_H_
//=============================================================================
//
// タイトルクラスヘッダー [title.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CTitleBg;

//=============================================================================
// タイトルクラス
//=============================================================================
class CTitle
{
public:

	CTitle();		// コンストラクタ
	~CTitle();		// デストラクタ

	HRESULT Init(void);					// 初期化処理
	void Uninit(void);					// 終了処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画処理
	static CTitleBg *GetTitleBg(void);	// タイトル背景の情報

private:
	static CTitleBg *m_pTitleBg;					// タイトル背景のポインタ
	int m_nCrowCreateFlame;							// カラスを出すフレーム
};
#endif